// Есть массив студентов:
// students2 = ['Абаканов Сергей', 'Алалина Алина', 'Гагарин Матвей', 'Хантухова Лейла', 'Викторов Сергей',  'Масалкин Андрей', 'Петравкин Алексей', 'Московин Павел', 'Данилов Станислав'];
// С помощью цикла while  вам нужно вывести на экран всех студентов начиная с Гагарина Матвея и заканчивая Петравкиным Алексеем. При условии, что мы видим массив и знаем, как расположены студенты в массиве.
var students2 = ["Абаканов Сергей", "Алалина Алина", "Гагарин Матвей", "Хантухова Лейла", "Викторов Сергей", "Масалкин Андрей", "Петравкин Алексей", "Московин Павел", "Данилов Станислав"];
for (var x = 2; x <= 5; x++) {
    alert(students2[x]);  
}